const state = {
  news: [
    {
      uuid: "a420871a-e9a3-4f3f-bbfe-a5311ef6ab8f",
      image: 'https://avatars.mds.yandex.net/i?id=f2ea3c359c2a9372e891e4ba59b3f2b0-5859964-images-thumbs&n=13',
      title: "Мастер-классы факультета ПММ для школьников",
      body: "29 апреля с 14:00 по 16:00 на факультете ПММ пройдёт серия мастер-классов для школьников, на которых преподаватели и студенты факультета на практике покажут, чем занимаются на факультете ПММ, и расскажут много интересного!<br><br>Темы занятий:<br>14:00. Дроны и чем их \"прошивают\". Мастер-класс ведет к.ф.-м.н., доцент, доцент кафедры механики и компьютерного моделирования Яковлев А. Ю.<br>14:00. Как создать и обучить свою первую нейросеть. Мастер-класс ведет д.т.н., доцент, профессор кафедры математических методов исследования операций Каширина И. Л. <br>15:00. Информационная и компьютерная безопасность. Мастер-класс ведет ст.науч.сотр. ФАУ \"Государственный научно-исследовательский испытательный институт проблем технической защиты информации Федеральной службы по техническому и экспортному контролю\", ст. преп. кафедры ERP-систем и бизнес-процессов (кафедра кибербезопасности информационных систем) Дергачев Ю. А. <br>15:00. Трехмерная компьютерная графика в Unity. Освещение сцены. Мастер-класс ведет инженер-программист ООО \"Техномаркет\", магистрант кафедры вычислительной математики и проектирования информационных систем Черняев Д. Е. <br><br>Записаться на мастер-класс можно по ссылке или сканируя qr-код. Количество мест ограничено.",
      dateCreated: new Date(2023, 4, 23),
      dateModified: new Date(2023, 4, 23)
    },
    {
      uuid: "7b09d45e-8b68-4ffd-b32d-ddf2e11c9153",
      image: 'http://nur-05.ru/media/k2/items/cache/b9ce7f5f2a6b6d39e0e2af59adeeab7e_XL.jpg',
      title: "Итоги олимпиады школьников по информатике",
      body: "9 апреля на базе факультета ПММ состоялась олимпиада ВГУ для школьников по информатике.<br>В олимпиаде приняли участие 38 школьников г. Воронежа и Воронежской области. Самый юный участник олимпиады является учеником 7 класса.<br>Участникам было предложено 5 задач разного уровня сложности. При выставлении баллов учитывалась не только корректная работа задач, но и эффективность предложенных решений.<br>По итогам проверки решений оргкомитетом было выделено 7 участников, которые удостоились дипломов различных степеней. Награждение состоялось 23 апреля в рамках дня открытых дверей факультета. Призёры, помимо наградных дипломов, получили памятные подарки, предоставленные компанией-партнером факультета ООО «Числа». Победителю был вручён в подарок квадрокоптер.<br><br>Список призеров и дипломантов олимпиады.<br><br>Призёры:<br>Иванников Даниил, ученик 11 класса гимназии им. академика Н. Г. Басова;<br>Рыбников Дмитрий, ученик 10 класса МБОУ СОШ №105;<br>Сальков Семён, ученик 11 класса МБОУ СОШ №106;<br>Филиппов Никита, ученик 11 класса МБОУ СОШ №98.<br><br>Дипломант 3 степени:<br>Бухонов Дмитрий, ученик 11 класса Воронежской православной гимназии во имя святителя Митрофана Воронежского.<br><br>Дипломант 2 степен:<br>Дементьев Андрей, ученик 11 класса МБОУ СОШ №98.<br><br>Победитель олимпиады:<br>Волович Евгений, ученик 9 класса МБОУ Лицея №1.<br><br>Поздравляем ребят!<br><br>Все участники и педагоги будут награждены сертификатами участника и благодарственными письмами.",
      dateCreated: new Date(2023, 4, 23),
      dateModified: new Date(2023, 4, 23)
    },
    {
      uuid: "168ed6c2-3cb3-4340-859d-6f3dc136b860",
      image: 'http://nur-05.ru/media/k2/items/cache/b9ce7f5f2a6b6d39e0e2af59adeeab7e_XL.jpg',
      title: "Олимпиада школьников по информатике",
      body: "МИНИСТЕРСТВО ОБРАЗОВАНИЯ И НАУКИ РФ<br>Федеральное государственное бюджетное образовательное учреждение высшего образования<br>«Воронежский государственный университет»<br><br>Олимпиада ВГУ для школьников по информатике<br>2022/2023 учебный год<br><br>Воронежский государственный университет в соответствии с Положением и Приказом ректора проводит Олимпиаду школьников по информатике. Участвовать в Олимпиаде имеют право все желающие. При этом к конкурсному зачету допускаются лишь учащиеся старших классов средних общеобразовательных учреждений РФ. Олимпиада проводится в один очный этап, который пройдет в ВГУ 9 апреля 2023 года.<br><br>Проведение олимпиады<br><br>Для участия в олимпиаде необходимо подать заявку, заполнив форму:<br>https://docs.google.com/forms/d/e/1FAIpQLSdApVo-eGv3nDU1W3seDJ7eQzvwtoWo_-dS7Q0eioyaQmtcHQ/viewform?usp=sf_link<br><br>Участникам будет предложено 5 задач. Решение каждой задачи может быть выполнено на одном из следующих языков программирования: Python, Pascal, Delphi, C/C++, Java, C#.<br><br>Проверка решений осуществляется в автоматическом режиме на сериях тестов. Кроме того, при выставлении баллов за алгоритмические задачи учитываются эффективность алгоритмов.<br><br>Результаты проверки решений будут опубликованы до 23 апреля 2023 года.<br><br>Со всеми возникающими вопросами обращайтесь в оргкомитет Олимпиады по Email:<br>Bolotova.svetlana@gmail.com с темой «Олимпиада школьников по информатике»",
      dateCreated: new Date(2023, 3, 28),
      dateModified: new Date(2023, 3, 28),
    },
    {
      uuid: "80c46087-dae8-46a9-a333-10800b98bfca",
      image: 'https://avatars.mds.yandex.net/i?id=41ce3bd2aa7b0b88340c3cf8375cfd1da811a1e9_l-9147977-images-thumbs&n=13',
      title: "Конференция работников и обучающихся факультета ПММ",
      body: "Конференция работников и обучающихся <br><br>факультета ПММ<br><br><br>Конференция работников и обучающихся факультета ПММ Воронежского государственного университета состоится 10 марта 2023 года в 13:30 в главном корпусе ВГУ, ауд. 226 (пл. Университетская, д.1, 2 этаж, ауд.226).  <br><br>Повестка дня:<br>Выборы членов Ученого Совета факультета ПММ в связи с истечением в 2023 году срока полномочий действующего состава Ученого Совета.<br><br><br>Декан факультета ПММ.                                  Медведев С.Н.<br><br>Секретарь Ученого Совета                              Аристова Е.М.",
      dateCreated: new Date(2023, 2, 11),
      dateModified: new Date(2023, 2, 11),
    },
    {
      uuid: "f43c905e-4479-46a6-b266-4ddbdd5467a4",
      image: 'https://i.ytimg.com/vi/QguU0gENfxo/maxresdefault.jpg',
      title: "Восстановление, перевод",
      body: "Заявления на восстановление, перевод между направлениями и с договора на бюджет будут приниматься с 20 января по 1 февраля.<br>Подробная информация - на сайте http://www.amm.vsu.ru/students/perevod-vosstanovlenie-otchislenie/",
      dateCreated: new Date(2023, 1, 11),
      dateModified: new Date(2023, 1, 11),
    }
  ]
}

const getters = {
  getNews: state => state.news,
  getNewsCount: state => state.news.length,
  getNewsByFilter: state => ({ field, value }) => state.news.filter(news => news[field] === value),
  getNewsByUuid: state => uuid => state.news.find(news => news.uuid === uuid),
  getNewsByTitle: state => title => state.news.find(news => news.title === title)
}

const mutations = {
  addNews: (state, payload) => {
    state.news.push(payload)
  },
  updateNews: (state, payload) => {
    const i = state.news.findIndex(x => x.uuid === payload.uuid)
    if (i !== -1) {
      state.news.splice(i, 1, payload)
    }
  }
}

const actions = {
  fetchNews: ({ commit, dispatch }, payload) => new Promise((resolve, reject) => {
    // make request
    commit('addNews', payload)
    return resolve()
  }),
  updateNews: (store, payload) => new Promise((resolve, reject) => {
    store.commit('updateNews', payload)
    return resolve()
  })
}

export default {
  namespaced: true,
  state,
  getters,
  mutations,
  actions
}
