<template>
  <Page>
    <h2>Информация для абитуриентов</h2>
    <p>12.11.2023 ВГУ проводит День открытых дверей. Все мероприятия, связанные с нашим факультетом, проходят по адресу Университетская площадь, 1 (главный копус) с 1200 в конференцзале.</p>
    <p><a>Обращение декана к абитуриентам</a></p>
    <el-collapse v-model="activeNames" @change="handleChange">
      <el-collapse-item title="Какой перечень документов для подачи заявления на поступление в ВУЗ?" name="1">
        Для поступления в ВУЗ необходимо предоставить следующие документы:
        <ul>
          <li>Заявление</li>
          <li>Паспорт</li>
          <li>Аттестат/Диплом</li>
          <li>СНИЛС</li>
          <li>Документы, подтверждающие особые права, преимущества, индивидуальные достижения</li>
          <li>2 фотографии</li>
          <li>Медсправка</li>
        </ul>
      </el-collapse-item>
      <el-collapse-item title="СПОСОБЫ ПОДАЧИ ДОКУМЕНТОВ" name="2">
        <ul>
          <li>Представляются в Университет лично поступающим;</li>
          <li>Направляются в Университет через операторов почтовой связи общего пользования;</li>
          <li>Направляются в Университет в электронной форме посредством электронной информационной системы Университета</li>
        </ul>
      </el-collapse-item>
      <el-collapse-item title="СРОКИ ПРИЁМА ДОКУМЕНТОВ" name="3">
        <ul>
          Специалитет, бюджет
          <li>С готовыми ЕГЭ – с 20.06 до 25.07</li>
          <li>На экзамены по материалам ВГУ – до 10.07</li>
        </ul>
        <ul>
          Специалитет, договор
          <li>С готовыми ЕГЭ – до 30.08</li>
          <li>На экзамены по материалам ВГУ – до 10.07</li>
        </ul>
        <ul>
          СПО
          <li>С 20.06 по 15.08</li>
        </ul>
      </el-collapse-item>
      <el-collapse-item title="ЗАЧИСЛЕНИЕ НА БЮДЖЕТ" name="4">
        <ul>
          Специалистов: без экзаменов + льготники + целевики:
          <li>28 июля – завершение приема оригиналов</li>
          <li>30 июля – приказ о зачислении</li>
        </ul>
        <ul>
          Общий конкурс:
          <li>3 августа – завершение приема оригиналов</li>
          <li>9 августа – приказ о зачислении</li>
        </ul>
      </el-collapse-item>
      <el-collapse-item title="ЗАЧИСЛЕНИЕ НА ДОГОВОР" name="5">
        Проводится по графику, устанавливаемому приемной комиссией, по мере оплаты договоров
      </el-collapse-item>
      <el-collapse-item title="По всем вопросам приема обращаться в" name="6">
        <ul>
          <li>Отдел довузовского образования ВГУ Адрес: 394018, г. Воронеж, Университетская площадь, 1, учебный корпус 1, к. 237</li>
          <li><a>Официальный сайт абитуриентов</a></li>
          <li>Электронная почта: <a>pt@vsu.ru</a></li>
          <li><a>Группа ВКонтакте</a></li>
        </ul>
        <p>График работы Приемной комиссии: пн.–пт.: 1000–1600 без перерыва</p>
        <p>Тел. +7(473)22-811-22, 8(800)100-83-61</p>
      </el-collapse-item>
      <el-collapse-item title="Подготовительные курсы" name="7">
        <p>Адрес: 394036, Россия, г. Воронеж, ул. Пушкинская, 16, к. 217</p>
        <p>Телефоны: +7 (473) 277-18-86, +7 (930) 403-06-81, +7 (473) 228-11-60 добавочные 3040, 3041</p>
        <p>E-mail: <a>belomytseva@vsu.ru, scheglova_yd@vsu.ru</a></p>
      </el-collapse-item>
      <el-collapse-item title="Возможные сферы трудоустройства" name="8">
        <ul>
          Наши выпускники:
          <li>Руководители фармацевтической отрасли на различных уровнях.</li>
          <li>Руководители аптечных сетей, аптечных организаций, аптечных складов.</li>
          <li>Персонал по продвижению лекарственных препаратов на фармацевтическом рынке.</li>
          <li>Провизоры-технологи, провизоры-аналитики.</li>
          <li>Сотрудники контрольно-аналитических, судебно-химических, фитохимических лабораторий.</li>
          <li>Специалисты по контролю качества и валидации на фармацевтических предприятиях</li>
          <li>Специалисты по фармаконадзору, гос. закупкам, гос. регистрации ЛП</li>
          <li>Медицинские представители фармацевтических компаний</li>
        </ul>
      </el-collapse-item>
    </el-collapse>
  </Page>
</template>

<script>
export default {
  name: "ArticlePage",
  head () {
    return { title: "Новость" }
  },
  computed: {
    pageTitle () {
      return this.$options.head().title
    },
  }
}
</script>

<style scoped>

</style>
