<template>
  <Page>
    <h2>История факультета</h2>
    <dev>Студенты 5 курса фармацевтического факультета Дунилин Александр и Болгов Алексей приняли участие в международном проекте популяризации науки Science Slam "Back to school", который проводился 8 сентября 2022 г на территории Винзавода. Задача ребят была представить свою работу так, чтобы она была понятна зрителям. Александр рассказал слушателям о том, какой секрет хранят в себе цветки каштана, раскрыл перспективность их дальнейшего исследования и использования в медицинской практике. Алексей в своем выступлении затронул актуальный вопрос старения живого организма, поделился исследованиями растительных антиоксидантов. В целом, студенты отметили высокий уровень организации и интересный формат мероприятия, выразили своё желание еще поучаствовать в данном проекте. Ребятам, было увлекательно выступать перед "неподготовленной" аудиторией, это полезный опыт постижения ораторского искусства.</dev>
    <div>

      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/Aleksandr.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/Alexsei.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/komanda.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/ferment.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/bezopasno.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/preparat.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/vk.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div> 
    <p>На фармацевтическом факультете ВГУ подведены итоги студенческого конкурса социальных просветительских проектов «Мы ЗА здоровый образ жизни».</p>
    <p>Во второй раз (первый раз в 2017 г.) по инициативе заведующей кафедрой фармакологии Бузлама Анны Витальевны на фармацевтическом факультете ВГУ проведен конкурс студенческих творческих социальных проектов агитационной направленности «Мы ЗА здоровый образ жизни». В конкурсе приняли участие 117 студентов 1 курса дневного отделения, во второй отборочный тур прошли 11 работ.</p>
    <p>Целью конкурса явилось повышение осознания роли студентов-провизоров в сохранении здоровья населения, выработке ответственного отношения к собственному здоровью и формирование готовности к проведению информационно-просветительской работы по пропаганде здорового образа жизни и безопасности жизнедеятельности среди населения, в том числе в молодежной среде.</p>
    <p>Тематика проектов затрагивала здоровый образ жизни, отказ от курения, алкоголя и наркотиков, проблему ВИЧ/СПИД, а так же вопросы правильного питания, физической активности и даже проблему влияния гаджетов на организм человека. При подготовке проектов многие студенты проявили не только достаточную заинтересованность и хороший уровень знаний по тематике проектов, но и творческий подход, креативное мышление, стремление к оригинальности, способность заинтересовать аудиторию слушателей.</p>  
    <p>Формами творческих проектов являлись: видеоролик, раздаточный материал (брошюра, буклет, листовка), постер (плакат), презентация с устным докладом. Каждая работа оценивалась по критериям информативности, наглядности, оригинальности и силе воздействия на целевую аудиторию.</p>
    <ul>
      Победителями стали:
      <li>в номинации «Лучший видеоролик» команда студентов Морозов Роман, Мартенс Артем, Казарова Татьяна</li>
      <li>в номинации «Лучший постер» команда студентов Арнаутова Дарья, Колесникова Алена;</li>
      <li>в номинации «Лучший доклад с презентацией» команда студентов Батманова Ольга, Олейникова Татьяна, Бурлуцкий Максим, Лазукина Дарья;</li>
      <li>в номинации «Лучший раздаточный материал» призовые места разделили 3 команды – 1 место команда студентов Бригадиренко Алина, Козлова Елена, Чернова Яна; 2 место – Винникова Алевтина, Новикова Дарья, Паромова Полина, Прибыткова Маргарита; 3 место – Диденков Анатолий, Кульнев Никита</li>
    </ul>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/kurenie.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/ostorogno.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/wibor.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/7.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <a>презентация по борьбе с курением, презентация по борьбе со СПИД.</a>
    <p>Студентка СПО фармацевтического факультета приняла участие в финале Всероссийской олимпиады профессионального мастерства в Казани.</p>  
    <p>C 18 по 20 апреля на базе Казанского государственного медицинского университета состоялся заключительный этап Всероссийской олимпиады профессионального мастерства обучающихся по специальности среднего профессионального образования 33.02.01. Фармация. Участниками стали представители из 34 регионов России. Наш университет участвует в этом мероприятии 2 раз, в этом году фармацевтический факультет ВГУ представляла победительница начального этапа олимпиады – студентка 3 курса СПО Ермакова Анастасия в сопровождении Рудой Маргариты (аспирантка кафедры ФХиФТ и ассистент кафедры фармакологии фармацевтического факультета).</p>
    <p>В течение трех дней участники выполняли задания, включающие в себя изготовление и контроль качества лекарственных препаратов, приемку товара и оформление витрины, фармацевтическое консультирование потребителей и отпуск лекарственных препаратов, а также перевод профессионального текста и компьютерное тестирование.</p>
    <p>
      - Я с удовольствием приняла участие во Всероссийской олимпиаде профессионального мастерства. За время пребывания в Казани я успела познакомиться и обменяться опытом с участниками из разных городов. Я испытала себя в различных сферах, что позволило получить большие навыки и знания в отдельных областях, - делится впечатлениями Анастасия.
      Ермакова Анастасия достойно выдержала испытания и продемонстрировала хороший уровень знаний и профессиональных умений. По результатам олимпиады Анастасия была награждена почетным дипломом «За волю к победе», желаем ей дальнейших успехов!
    </p>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/vse.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/diplom.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/halat.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/spo.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <p>
      На прошедщей 19.12.2017 в Курском государственном медицинском университете межвузовской студенческой олимпиаде по фармакологии Центрального региона России «Фармаколог - 2017»
      <a>команда нашего факультета заняла 2 место.</a>
    </p>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/sredstva.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/ohki.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <p>27 ноября по 3 декабря 2017 г проходила Всероссийская акция «Стоп ВИЧ/СПИД», в том числе трансляции открытого студенческого форума «Остановим СПИД вместе» и <a> Всероссийский открытый интернет-урок «День единых действий по информированию детей и молодежи о профилактике ВИЧ-инфекции «ЗНАНИЕ-ОТВЕТСТВЕННОСТЬ-ЗДОРОВЬЕ».</a> Цель мероприятия - привлечь внимание к проблеме ВИЧ-инфекции и СПИДа, донести до каждого правильную и полную информацию об этой болезни, помочь защитить себя и своих близких.</p>
    <p>Пройти бесплатное анонимное тестирование для определение ВИЧ-статуса можно в поликлинике по месту жительства или в Воронежском областном клиническом центре профилактики и борьбы со СПИД (г. Воронеж пр. Патриотов 29б, <a> http://voronezh-aids.ru</a>) Полную информацию по проблеме ВИЧ/СПИД можно получить на сайте <a> http://стопвичспид.рф</a>.</p>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/spid_pam1.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/spid.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <p>
      23-25 октября состоялась XXII Конференция РПКА (Российской Парфюмерно-Косметической Ассоциации), в которой приняли участие Караваева Мария Викторовна (студентка 5 курса) и
      <a>Веретенникова Мария Александровна</a> (ассистент кафедры ФХ и ФТ) в формате постерной сессии в "Конкурсе Молодых Ученых".
    </p>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/gerl.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/konkurs.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <p><a>Наши студенты приняли участие в работе VI-го Фармацевтического Интернационального Лагеря Инноваций – ФИЛИН 22-29 сентября 2017 года.</a></p>
    <p><a>С 5 по 7 июля 2017 года в Туле наши студенты и аспиранты участвовали в Первом Всероссийском межвузовском GxP-саммите с международным участием «Выбор лучших. Время вперёд».</a></p>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/vero.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/dada.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/flags.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <p>19-21 апреля 2017 г. в г.Пенза впервые состоялся финальный этап Всероссийской олимпиады среди студентов СПО по направлению «Фармация».</p>
    <div>
      <el-carousel :interval="5000" arrow="always">
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/vse2.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/kolpak.jpg`)" alt="">
        </el-carousel-item>
        <el-carousel-item>
          <img :src="require(`~/assets/images/history/diplom2.jpg`)" alt="">
        </el-carousel-item>
      </el-carousel>
    </div>
    <p>
      Изменения, произошедшие в нашей стране в начале 90-х годов прошлого века, привели к резкому снижению научных разработок, НИИ химии ВГУ остался практически без средств к существованию. Кроме того, бурный рост частной аптечной сети и распад системы распределения молодых специалистов привёл к резкой нехватке фармацевтов и провизоров в регионе. Идею создания фармацевтического факультета на базе классического университета, выдвинутую 
      <a> А.И.Сливкиным</a>
      , поддержали деканы химического (Ю.П.Афиногенов) и биолого-почвенного (В.Г.Артюхов) факультетов, ректорат. В 1993 году состоялся первый набор иностранных граждан.
    </p>
    <p>Второй набор, совместно с ВГМА, был осуществлён в 1994 году, после переговоров с медакадемией о совместном использовании медицинской базы для обучения провизоров.</p>
    <p>До 1998 года наборы в соответствии с Учредительным договором осуществлялись вузами самостоятельно. В 1998 году было принято решение о наборе студентов силами ВГУ; созданы 2 выпускающие кафедры - фармацевтической химии и технологии ГЛС (ВГУ) и фармацевтичского дела (ВГМА). После получения лицензии на совместную образовательную деятельность ВГУ и ВГМА по специальности 040500 "Фармация" по очной форме обучения (Приказ Министерства №1272 от 21.05.98) с 1998 г. на факультет осуществляется набор как иностранных, так и российских граждан на договорной основе. С 2000 г. проводится набор на бюджетной основе за счёт контингента Министерства образования. В дипломах выпускников 1998-2000 гг. стояло две гербовые печати и подписи ректоров обоих вузо</p>
    <p>При плановой аттестации университета в декабре 2000 года комиссия признала межвузовский факультет ВГУ прошедшим лицензионную и аттестационную экспертизы, но признала нецелесообразным, не соответствующим Закону об образовавании функционирование факультета на базе двух вузов. Сложности в организации учебного процесса, связанные с проблемами составления и контроля исполнения расписания занятий, различными методическими подходами в преподавании дисциплин и ряд других организационных условий, по мнению комиссии, требовали серьёзных изменений из-за значительных трудностей для студентов, отсутствия определённости за качество подготовки специалистов. На основании проведённого анализа комиссия рекомендовала передать профильные дисциплины в ведение ВГУ, учитывая наличие отдельного корпуса для факультета, хорошей материальной базы, полного комплекта учебного и научного оборудованя, значительных вложений средств в развитие учебного процесса, а после открытия клинической кафедры - определить юридическим лицом фармацевтического факультета ВГУ.</p>
    <p>С 2001 года, в связи с окончанием срока Учредительного договора и рекомендациями аттестационой комиссии, фармацевтический факультет функционирует при Воронежском государственном университете.</p>
  </Page>
</template>

<script>
export default {
  name: "ArticlePage",
  head () {
    return { title: "Новость" }
  },
  computed: {
    pageTitle () {
      return this.$options.head().title
    },
  }
}
</script>

<style scoped>

</style>
