<template>
  <Page>
    <h2>Список страниц:</h2>
    <ul>
      <li v-for="page in pages" :key="page.name">
        <nuxt-link :to="{ name: page.name }">{{ page.name }}</nuxt-link>
      </li>
    </ul>
    <nuxt-link to="/card-new-preview">Card</nuxt-link>


    <div>
      <h2>Факультет</h2>
      <p>Фармацевтический факультет Воронежского государственного университета организован в 1993 году.</p>
      <p>Факультет готовит специалистов с полным возмещением затрат за счет федеральных средств (50 бюджетных мест) и по договорам с физическими и юридическими лицами. Ежегодно факультет выпускает около 150 специалистов с высшим образованием и около 20 специалистов со средним профессиональным образованием.</p>
      <p>Число обучающихся на программах переподготовки и повышения квалификации ежегодно составляет около 250 человек.</p>
      <p>За время существования факультет подготовил более 1100 специалистов с высшим образованием и около 400 специалистов со средним специальным образованием.</p>
      <p>Факультет реализует систему непрерывного фармацевтического образования, которая включает следующие основные образовательные программы (ООП):</p>
      <ul>
        <li>программа среднего профессионального образования (СПО). Специальность «Фармация»;</li>
        <li>программа высшего образования (ВО). Форма обучения — очная. Специальность «Фармация»;</li>
        <li>программы ординатуры по трем специальностям: Управление и экономика фармации, Фармацевтическая химия и фармакогнозия, Фармацевтическая технология;</li>
        <li>аспирантура по трем специальностям: Фармацевтическая химия и фармакогнозия, Организация фармацевтического дела, Клиническая фармакология;</li>
        <li>программы переподготовки специалистов по всем специальностям;</li>
        <li>программы повышения квалификации для специалистов со средним и высшим фармацевтическим образованием.</li>
      </ul>
      <p>Факультет обеспечивает возможность построения гибких образовательных траекторий по всем уровням образования.</p>
      <p>Реализация образовательных программ осуществляется в соответствии с требованиями актуализированных федеральных образовательных стандартов.</p>
      <p>Все образовательные программы разработаны с участием представителей крупнейших работодателей регионального фармацевтического рынка и прошли экспертизу на соответствие международному стандарту качества BS EN ISO 9001:2008, в 2009 году пройдена повторная сертификация СМК. Сертификат выдан органом по сертификации NQA Global Assurance Limited (Великобритания).</p>
      <p>Более 98% выпускников трудоустраиваются по специальности, 2% трудоустраиваются медицинскими представителями.</p>
      <p>География трудоустройства выпускников факультета подтверждает качество подготовки специалистов на факультете. Выпускники работают во всех крупных российских и региональных аптечных сетях, на ведущих фармацевтических предприятиях, в органах исполнительной власти субъектов федерации и муниципальных образований.</p>
    </div>

    <div>
      <h2>Контакты</h2>
      <div>
        <div>
          Адрес: 394006, г. Воронеж, Университетская пл., 1.
        </div>
        <div>
          Учебная часть факультета: 394036, г. Воронеж, Студенческая ул., 3.
        </div>
        <div>
          Тел.: (473) 253-07-89; 253-04-28; 255-47-76.
        </div>
        <div>
          Факс: (473) 253-04-28.
        </div>
        <div>
          e-mail: deanery@pharm.vsu.ru
        </div>
      </div>
    </div>
  </Page>
</template>

<script>
export default {
  name: 'IndexPage',
  head () {
    return { title: "Факультет" };
  },
  computed: {
    pages () {
      return this.$router.options.routes
        .filter((route) => route.path !== "/")
        .map((route) => ({ name: route.name }))
    },
  },
}
</script>
