<template>
  <Page>
    <p>Фармацевтический факультет Воронежского государственного университета организован в 1993 году.</p>
    <p>Факультет готовит специалистов с полным возмещением затрат за счет федеральных средств (50 бюджетных мест) и по договорам с физическими и юридическими лицами. Ежегодно факультет выпускает около 150 специалистов с высшим образованием и около 20 специалистов со средним профессиональным образованием.</p>
    <p>Число обучающихся на программах переподготовки и повышения квалификации ежегодно составляет около 250 человек.</p>
    <p>За время существования факультет подготовил более 1100 специалистов с высшим образованием и около 400 специалистов со средним специальным образованием.</p>
    <p>Факультет реализует систему непрерывного фармацевтического образования, которая включает следующие основные образовательные программы (ООП):</p>
    <ul>
      <li>программа среднего профессионального образования (СПО). Специальность «Фармация»;</li>
      <li>программа высшего образования (ВО). Форма обучения — очная. Специальность «Фармация»;</li>
      <li>программы ординатуры по трем специальностям: Управление и экономика фармации, Фармацевтическая химия и фармакогнозия, Фармацевтическая технология;</li>
      <li>аспирантура по трем специальностям: Фармацевтическая химия и фармакогнозия, Организация фармацевтического дела, Клиническая фармакология;</li>
      <li>программы переподготовки специалистов по всем специальностям;</li>
      <li>программы повышения квалификации для специалистов со средним и высшим фармацевтическим образованием.</li>
    </ul>
    <p>Факультет обеспечивает возможность построения гибких образовательных траекторий по всем уровням образования.</p>
    <p>Реализация образовательных программ осуществляется в соответствии с требованиями актуализированных федеральных образовательных стандартов.</p>
    <p>Все образовательные программы разработаны с участием представителей крупнейших работодателей регионального фармацевтического рынка и прошли экспертизу на соответствие международному стандарту качества BS EN ISO 9001:2008, в 2009 году пройдена повторная сертификация СМК. Сертификат выдан органом по сертификации NQA Global Assurance Limited (Великобритания).</p>
    <p>Более 98% выпускников трудоустраиваются по специальности, 2% трудоустраиваются медицинскими представителями.</p>
    <p>География трудоустройства выпускников факультета подтверждает качество подготовки специалистов на факультете. Выпускники работают во всех крупных российских и региональных аптечных сетях, на ведущих фармацевтических предприятиях, в органах исполнительной власти субъектов федерации и муниципальных образований.</p>
  </Page>
</template>

<script>
import Page from '@/components/main/page/Page'

export default {
  name: "o-nas",
  head () {
    return { title: "О нас" };
  },
  components: {
    Page
  }
}
</script>

<style scoped>

</style>
